In [1]:
import numpy as np
import pandas as pd
from math import log

In [5]:
filename = 'wig.txt'
#data = np.loadtxt(filename, delimiter=',', skiprows=1, dtype=str)

In [6]:
#data

In [10]:
temp_df = pd.read_csv(filename, sep=",",header=0)
print(temp_df)

     <TICKER> <PER>    <DATE>  <TIME>    <OPEN>    <HIGH>     <LOW>   <CLOSE>  \
0         WIG     D  19910416       0   1000.00   1000.00   1000.00   1000.00
1         WIG     D  19910423       0    967.70    967.70    967.70    967.70
2         WIG     D  19910430       0    945.60    945.60    945.60    945.60
3         WIG     D  19910514       0    939.60    939.60    939.60    939.60
4         WIG     D  19910521       0    966.10    966.10    966.10    966.10
...       ...   ...       ...     ...       ...       ...       ...       ...
6977      WIG     D  20201228       0  56223.64  57186.74  56223.64  57172.46
6978      WIG     D  20201229       0  57468.75  57878.17  57404.11  57701.40
6979      WIG     D  20201230       0  57741.72  57741.89  56972.80  57025.84
6980      WIG     D  20210104       0  57231.39  58127.26  57215.50  57954.68
6981      WIG     D  20210105       0  57841.42  58527.25  57700.58  58027.01

         <VOL>  <OPENINT>
0          325          0
1         5905          0
2         7162          0
3        18300          0
4        14750          0
...        ...        ...
6977  80355295          0
6978  60452188          0
6979  62059433          0
6980  85513264          0
6981  80924974          0

[6982 rows x 10 columns]

In [11]:
df=pd.DataFrame()
df["date"]=temp_df["<DATE>"]
df["price"]=temp_df["<CLOSE>"]

In [12]:
temp_df["<TIME>"].value_counts()

0    6982
Name: <TIME>, dtype: int64

In [13]:
df.head()

       date   price
0  19910416  1000.0
1  19910423   967.7
2  19910430   945.6
3  19910514   939.6
4  19910521   966.1

In [14]:
df['date'] = pd.to_datetime(df['date'], format="%Y%m%d")

In [15]:
df.tail()

           date     price
6977 2020-12-28  57172.46
6978 2020-12-29  57701.40
6979 2020-12-30  57025.84
6980 2021-01-04  57954.68
6981 2021-01-05  58027.01

In [46]:
#df.to_csv("data.csv", index=False)
#df.to_csv("data.csv", index=True)

In [31]:
for i in df.index:
    if i==0:
        continue
    elif i>0:
        df["rate"][i]=log(df["price"][i]/df["price"][i-1])

/Applications/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [32]:
df.head()

        date   price      rate
0 1991-04-16  1000.0  0.001247
1 1991-04-23   967.7 -0.032833
2 1991-04-30   945.6 -0.023102
3 1991-05-14   939.6 -0.006365
4 1991-05-21   966.1  0.027813

In [33]:
df.loc[df.index == 0, 'rate'] = float("NaN")

In [34]:
df.head()

        date   price      rate
0 1991-04-16  1000.0       NaN
1 1991-04-23   967.7 -0.032833
2 1991-04-30   945.6 -0.023102
3 1991-05-14   939.6 -0.006365
4 1991-05-21   966.1  0.027813

In [35]:
df.to_csv("data.csv", index=False)